import { useState } from "react";
import middle from "../../images/Single Product/mobile/Middle.png";


const ProductAllAtributes = () => {

    const [openTabAttributes, setOpenTabAttributes] = useState("طراحی");

    return (
        <>
            <div className="md:hidden bg-stone-100 dark:bg-slate-600 w-72 justify-center py-1 flex rounded-3xl overflow-hidden mb-8 mx-auto">
                    <button onClick={() => setOpenTabAttributes("دوربین")} className={`${openTabAttributes === "دوربین" && "shadow-[0_0_10px__rgba(0,0,0,0.2)] bg-white dark:bg-gray-300 dark:text-slate-800"} py-2 px-6 rounded-3xl text-center`}>دوربین</button>
                    <button onClick={() => setOpenTabAttributes("طراحی")} className= {`${openTabAttributes === "طراحی" && "shadow-[0_0_10px__rgba(0,0,0,0.2)] bg-white dark:bg-gray-300 dark:text-slate-800"} py-2 px-6 rounded-3xl text-center`}>طراحی</button>
                    <button onClick={() => setOpenTabAttributes("باتری")} className={`${openTabAttributes === "باتری" && "shadow-[0_0_10px__rgba(0,0,0,0.2)] bg-white dark:bg-gray-300 dark:text-slate-800"} py-2 px-6 rounded-3xl text-center`}>باتری</button>
                </div>

                {
                    openTabAttributes === "دوربین" && <>
                        <h3 className="mb-5 text-xl font-bold md:hidden">دوربین</h3>
                        <p className="mb-4 text-slate-800 dark:text-stone-300 md:hidden">
                            شاید در نگاه اول و بر روی کاغذ، سنسور‌های دوربین در نظر گرفته شده برای آیفون13 چندان تفاوتی با سنسور‌های دوربین آیفون 12 نداشته باشند، اما بدون شک آیفون 13 می‌تواند در این بخش عملکرد بهتری به نسبت مدل آیفون 12 داشته باشد. شاید از خودتان بپرسید که چرا؟ در ادامه به شما خواهیم گفت. در ابتدا نگاهی به مشخصات سنسور‌های دوربین در نظر گرفته شده برای این گوشی‌هوشمند خواهیم داشت. یک سنسور دوربین اصلی با رزولوشن 12 مگاپیکسل، گشودگی دریچه دیافراگم f/1.6، فاصله کانونی 26 میلی متر از نوع عریض به‌همراه سنسور دوربین از نوع فوق عریض (ultra wide) با رزولوشن 12 مگاپیکسل، گشودگی دریچه دیافراگم f/2.4، زاویه دید 120 درجه و فاصله کانونی 13 میلی‌متر، سنسور‌های دوربین دوگانه آیفون 13 را تشکیل می‌دهند. برای دوربین سلفی نیز، سنسور 12 مگاپیکسل از نوع عریض با گشودگی دریچه دیافراگم f/2.2 در نظر گرفته شده که توانایی ضبط ویدیو با کیفیت 4K و نرخ 60 فریم در ثانیه را هم دارد. اما چرا آیفون 13 با بهره بردن از سنسور‌های دوربین مشابه با آیفون 12 می‌تواند خروجی تصاویر با‌کیفیت‌تری را ارائه دهد؟ دلیل اصلی این اتفاق، پردازنده قدرتمند‌تر در نظر گرفته شده برای آیفون 13 است. یکی از اصلی ترین دلایل برای خروجی تصاویر بهتر، پردازنده تصویری یا همان ISP است که یکی از بخش‌های پردازنده است. پس به‌طبع بهره بردن از پردازنده قدرتمند‌تر، خروجی تصاویر با‌کیفیت‌تری را ارائه می‌کند. عملکرد سنسور دوربین اصلی 12 مگاپیکسلی در نور روز جای هیچ حرف و حدیثی را باقی نگذاشته است. داینامیک رنج بسیار جذاب، جزئیات عالی و کنتراست بسیار جذاب در تصاویر خروجی ثبت شده به‌خوبی دیده می‌شود. گشودگی دریچه دیافراگم هم جذب نور بسیار خوبی دارد و این نشان از عملکرد عالی این گوشی هوشمند در ثبت تصاویر شب یا در نور کم دارد. سنسور دوربین فوق عریض نیز با زاویه دید گسترده‌تر به نسبت سنسور دوربین اصلی، این امکان را برای شما فراهم می‌کند که تصاویری با زاویه دید باز و بسیار جذاب (برای مثال عکاسی در طبیعت و عکس‌های گروهی) به ثبت برسانید.
                        </p>
                    </>
                }
                <div className="hidden md:block mb-10">
                  <h3 className="mb-5 text-xl font-bold ">دوربین</h3>
                    <p className="mb-4 text-slate-800 dark:text-stone-300">
                        شاید در نگاه اول و بر روی کاغذ، سنسور‌های دوربین در نظر گرفته شده برای آیفون13 چندان تفاوتی با سنسور‌های دوربین آیفون 12 نداشته باشند، اما بدون شک آیفون 13 می‌تواند در این بخش عملکرد بهتری به نسبت مدل آیفون 12 داشته باشد. شاید از خودتان بپرسید که چرا؟ در ادامه به شما خواهیم گفت. در ابتدا نگاهی به مشخصات سنسور‌های دوربین در نظر گرفته شده برای این گوشی‌هوشمند خواهیم داشت. یک سنسور دوربین اصلی با رزولوشن 12 مگاپیکسل، گشودگی دریچه دیافراگم f/1.6، فاصله کانونی 26 میلی متر از نوع عریض به‌همراه سنسور دوربین از نوع فوق عریض (ultra wide) با رزولوشن 12 مگاپیکسل، گشودگی دریچه دیافراگم f/2.4، زاویه دید 120 درجه و فاصله کانونی 13 میلی‌متر، سنسور‌های دوربین دوگانه آیفون 13 را تشکیل می‌دهند. برای دوربین سلفی نیز، سنسور 12 مگاپیکسل از نوع عریض با گشودگی دریچه دیافراگم f/2.2 در نظر گرفته شده که توانایی ضبط ویدیو با کیفیت 4K و نرخ 60 فریم در ثانیه را هم دارد. اما چرا آیفون 13 با بهره بردن از سنسور‌های دوربین مشابه با آیفون 12 می‌تواند خروجی تصاویر با‌کیفیت‌تری را ارائه دهد؟ دلیل اصلی این اتفاق، پردازنده قدرتمند‌تر در نظر گرفته شده برای آیفون 13 است. یکی از اصلی ترین دلایل برای خروجی تصاویر بهتر، پردازنده تصویری یا همان ISP است که یکی از بخش‌های پردازنده است. پس به‌طبع بهره بردن از پردازنده قدرتمند‌تر، خروجی تصاویر با‌کیفیت‌تری را ارائه می‌کند. عملکرد سنسور دوربین اصلی 12 مگاپیکسلی در نور روز جای هیچ حرف و حدیثی را باقی نگذاشته است. داینامیک رنج بسیار جذاب، جزئیات عالی و کنتراست بسیار جذاب در تصاویر خروجی ثبت شده به‌خوبی دیده می‌شود. گشودگی دریچه دیافراگم هم جذب نور بسیار خوبی دارد و این نشان از عملکرد عالی این گوشی هوشمند در ثبت تصاویر شب یا در نور کم دارد. سنسور دوربین فوق عریض نیز با زاویه دید گسترده‌تر به نسبت سنسور دوربین اصلی، این امکان را برای شما فراهم می‌کند که تصاویری با زاویه دید باز و بسیار جذاب (برای مثال عکاسی در طبیعت و عکس‌های گروهی) به ثبت برسانید.
                    </p>
                </div>



                {
                    openTabAttributes === "طراحی" && <>
                        <h3 className="mb-5 text-xl font-bold md:hidden">طراحی</h3>
                        <p className="mb-4 md:hidden">
                            اپل چندان تمایلی به تغییر طراحی‌های موفق خود ندارد و ترجیح می‌دهد تا زبان طراحی موفق و جذاب خود را حفظ کند. آیفون 13 نیز از طراحی مشابهی با نسل قبلی خود بهره برده است. در نمای رو‌به‌رویی همان ناچ و بریدگی آشنای سری‌های قبلی را می‌بینیم که این بار عرض کمتری به نسبت ناچ صفحه‌نمایش آیفون 12 دارد. در نمای پشتی هم شاهد قرار گیری دو سنسور دوربین می‌باشیم که بر‌خلاف مدل آیفون 12، این بار دو سنسور دوربین با چیدمانی ضربدری با فلش LED در بریدگی مربعی شکل قرار گرفته‌اند. این در حالی است که دو سنسور دوربین قسمت پشتی آیفون 12 با چیدمانی ستونی شکل در کنار یکدیگر قرار گرفته‌اند.
                        </p>
                    </>
                }
                <div className="hidden md:block">
                  <h3 className="mb-5 text-xl font-bold">طراحی</h3>
                    <p className="mb-4">
                        اپل چندان تمایلی به تغییر طراحی‌های موفق خود ندارد و ترجیح می‌دهد تا زبان طراحی موفق و جذاب خود را حفظ کند. آیفون 13 نیز از طراحی مشابهی با نسل قبلی خود بهره برده است. در نمای رو‌به‌رویی همان ناچ و بریدگی آشنای سری‌های قبلی را می‌بینیم که این بار عرض کمتری به نسبت ناچ صفحه‌نمایش آیفون 12 دارد. در نمای پشتی هم شاهد قرار گیری دو سنسور دوربین می‌باشیم که بر‌خلاف مدل آیفون 12، این بار دو سنسور دوربین با چیدمانی ضربدری با فلش LED در بریدگی مربعی شکل قرار گرفته‌اند. این در حالی است که دو سنسور دوربین قسمت پشتی آیفون 12 با چیدمانی ستونی شکل در کنار یکدیگر قرار گرفته‌اند.
                    </p>
                    <img className="block mx-auto" src={middle} alt="middle" />
                </div>


                {
                    openTabAttributes === "باتری" && <>
                        <h3 className="mb-5 text-xl font-bold md:hidden">باتری</h3>
                        <p className="mb-4 md:hidden">
                        باید قبول کنیم که تا به امروز، پردازنده‌های قدرتمند گوشی‌های هوشمند اپل در کنار سیستم عامل بی‌نظیر iOS توانسته اند عملکرد بسیار شگفت‌انگیزی را به نمایش بگذارند. این بار هم آیفون 13 همانند برادران بزرگترش، یعنی آیفون 13 پرو وآیفون 13 پرو مکس، به قدرتمند‌ترین پردازنده این شرکت یعنیُ A15 بایونیک مجهز شده است. پردازنده ای با معماری 5 نانومتری و متشکل از 6 هسته (2 هسته قدرتمند‌تر به‌همراه 4 هسته با کارایی معمولی و صرفه انرژی کمتر). برای GPU یا همان پردازنده گرافیکی نیست، پردازنده اختصاصی 4 هسته‌ای در نظر گرفته شده است. با توجه به نتایج بنچمارک و تست های انجام شده باید بگوییم که هیچ بازی در دنیا وجود ندارد که آیفون 13 با بهره بردن از چنین پردازنده قدرتمندی، توانایی اجرا آن را نداشته باشد. البته لازم به ذکر است که این گوشی توانایی اجرای بازی های سنگینی همچون کال‌آ‌ف‌دیوتی موبایل و آسفالت 9 را در بالاتری تنظیمات گرافیکی خواهد داشت. از طرفی معماری 5 نانومتری این پردازنده نیز سبب شده تا به‌نسبت پردازنده‌هایی با معماری 7 و 10 نانومتری مصرف انرژی کمتری داشته باشد و در نهایت طول عمر مفید طولانی‌تری به ازای هر بار شارژ 100 درصدی ارائه کند.
                        </p>
                    </>
                }
                <div className="hidden md:block mb-10">
                  <h3 className="mb-5 text-xl font-bold">باتری</h3>
                  <p className="mb-4">
                  باید قبول کنیم که تا به امروز، پردازنده‌های قدرتمند گوشی‌های هوشمند اپل در کنار سیستم عامل بی‌نظیر iOS توانسته اند عملکرد بسیار شگفت‌انگیزی را به نمایش بگذارند. این بار هم آیفون 13 همانند برادران بزرگترش، یعنی آیفون 13 پرو وآیفون 13 پرو مکس، به قدرتمند‌ترین پردازنده این شرکت یعنیُ A15 بایونیک مجهز شده است. پردازنده ای با معماری 5 نانومتری و متشکل از 6 هسته (2 هسته قدرتمند‌تر به‌همراه 4 هسته با کارایی معمولی و صرفه انرژی کمتر). برای GPU یا همان پردازنده گرافیکی نیست، پردازنده اختصاصی 4 هسته‌ای در نظر گرفته شده است. با توجه به نتایج بنچمارک و تست های انجام شده باید بگوییم که هیچ بازی در دنیا وجود ندارد که آیفون 13 با بهره بردن از چنین پردازنده قدرتمندی، توانایی اجرا آن را نداشته باشد. البته لازم به ذکر است که این گوشی توانایی اجرای بازی های سنگینی همچون کال‌آ‌ف‌دیوتی موبایل و آسفالت 9 را در بالاتری تنظیمات گرافیکی خواهد داشت. از طرفی معماری 5 نانومتری این پردازنده نیز سبب شده تا به‌نسبت پردازنده‌هایی با معماری 7 و 10 نانومتری مصرف انرژی کمتری داشته باشد و در نهایت طول عمر مفید طولانی‌تری به ازای هر بار شارژ 100 درصدی ارائه کند.
                  </p>
                </div>
        </>
    );
}
 
export default ProductAllAtributes;