import { useState } from "react";

const ProductReview = () => {
    
    const [openReviewSection, setOpenReviewSection] = useState(false);

    return (
        <>
            <h3 className="mb-5 text-xl font-bold ">نقد و بررسی این محصول</h3>
            <p className={`mb-4 ${openReviewSection ? "h-full text-clip overflow-visible" : "text-ellipsis overflow-hidden h-72" } dark:text-stone-300 md:h-full md:text-clip md:overflow-visible`}>
              گوشی موبایل «iPhone 13» پرچم‌دار جدید شرکت اپل است که با چند ویژگی
              جدید و دوربین دوگانه روانه بازار شده است. اپل برای ویژگی‌ها و
              طراحی کلی این گوشی از همان فرمول چند سال اخیرش استفاده کرده است.
              نمایشگر آیفون 13 به پنل Super Retina مجهز ‌شده است تا تصاویر بسیار
              مطلوبی را به کاربر عرضه کند. این نمایشگر رزولوشن بسیار بالایی
              دارد؛ به‌طوری‌که در اندازه­‌ی 6.1 اینچی‌اش، حدود 460 پیکسل را در
              هر اینچ جا داده است. امکان شارژ بی‌‌سیم باتری در این گوشی وجود
              دارد. روکش سرامیکی صفحه‌نمایش این گوشی می‌تواند انقلابی در محافظت
              به‌پا کند. این گوشی ضدآب و ضد گردوخاک است. بدنه­ زیبا iPhone 13 در
              مقابل خط‌‌وخش مقاومت زیادی دارد؛ پس خیالتان از این بابت که آب و
              گردوغبار به‌‌راحتی روی آیفون 13 تأثیر نمی‌‌گذارد، راحت باشد.
              علاوه‌براین لکه و چربی هم روی این صفحه‌نمایش باکیفیت تأثیر چندانی
              ندارند. تشخیص چهره با استفاده از دوربین جلو دیگر ویژگی است که در
              آیفون جدید اپل به کار گرفته شده است. قابلیت اتصال به شبکه­‌های 4G
              و 5G، بلوتوث نسخه‌ 5، نسخه­‌ 15 از iOS دیگر ویژگی‌های این گوشی
              هستند. ازنظر سخت‌‌افزاری هم این گوشی از تراشه­‌ی جدید A15 بهره
              می‌برد که دارای 15 میلیارد ترانزیستور است که دارای کنترل گرمای
              مطلوبی بوده که تا بتواند علاوه بر کارهای معمول، از قابلیت‌های جدید
              واقعیت مجازی که اپل این روزها روی آن تمرکز خاصی دارد، پشتیبانی
              کند. به گفته خود شرکت اپل این گوشی دارای سرعتی 50 برابر نسخه 12
              خود است. پردازنده دارای ماژولار جدیدی است که مصرف باتری را بسیار
              پایین‌تر آورده است و شما دارای حفظ باتری بالاتری هستید. کیفیت
              نمایش شما در iPhone 13 دارای 120 هرتز است و کسفیت بالایی را شاهد
              خواهید بود. اپل در این سری از گوشی‌های iPhone خود پردازنده
              گرافیکی‌ای را قرار داده که از سری 12 گوشی‌های خود 30 درصد سریع‌تر
              است و این نویدبخش آن است که شما می‌توانید بازی‌هایی را با گرافیک و
              MAP سنگین تر و بزرگ‌تر اجرا کنید. یکی از ویژگی‌هایی که در iPhone
              13 شاهد هستیم سیستم فیلمبرداری ProRes سینمایی آن است که می تواند
              انقلابی در فیلمبرداری گوشی‌های موبایل به‌راه انداخته باشد. این
              قابلیت می‌تواند نسبت به صورت روبرو بین افراد و یا بین فرد و اشیا
              فوکوس و بِلار داشته باشد.
            </p>
            <p onClick={() => setOpenReviewSection(prev => !prev)} className="md:hidden cursor-pointer text-orange-500 font-medium text-left">
                {openReviewSection ? "بستن مطلب" : "ادامه مطلب"}
            </p>
        </>
    );
}
 
export default ProductReview;